ERP.belugaerp/src/Enums/НазначенияВидовЦен/НазначенияВидовЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>НазначенияВидовЦен</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Общий</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/Enums/СтатусыДействияВидовЦен/СтатусыДействияВидовЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыДействияВидовЦен</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Действует</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

ERP.belugaerp/src/CommonModules/бг_ВидыЦенИнтеграция/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьЗагружаемыйОбъект(ЗагружаемыйОбъект, СтруктураОбъекта, СписокСвойств, ИсключаяСвойства, СтандартнаяОбработка) Экспорт
	
	Если бг_ОбщегоНазначенияСервер.ОтменитьЗагрузкуОбъекта(ЗагружаемыйОбъект, 
		СтруктураОбъекта, Неопределено, Неопределено, СтандартнаяОбработка) Тогда
			Возврат;
	КонецЕсли;
		
	ЗагружаемыйОбъект.ИспользоватьПриПродаже = Истина;
	ЗагружаемыйОбъект.Наценка = СтруктураОбъекта.ПроцентСкидкиНаценки;
	ЗагружаемыйОбъект.Назначение = Перечисления.НазначенияВидовЦен.Общий;
	ЗагружаемыйОбъект.Округлять = Истина;
	ЗагружаемыйОбъект.ТочностьОкругления = ТочностьОкругленияПоВходящимДанным(СтруктураОбъекта.ПорядокОкругления);
	ЗагружаемыйОбъект.ИспользоватьПриОптовойПродаже = Истина;
	ЗагружаемыйОбъект.Идентификатор = ОбщегоНазначенияУТКлиентСервер.ПолучитьИдентификатор(СтруктураОбъекта.Наименование);
	
	Если СтруктураОбъекта.Свойство("БазовыйТипЦен") Тогда
		СтруктураОбъекта.Вставить("БазовыйВидЦены", СтруктураОбъекта.БазовыйТипЦен); 
	КонецЕсли;
	
	Если СтруктураОбъекта.СпособРасчетаЦены = "ПоПроцентнойНаценкеНаБазовыйТип" Тогда
		ЗагружаемыйОбъект.СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.НаценкаНаДругойВидЦен; 	
	Иначе
		ЗагружаемыйОбъект.СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.Вручную;
	КонецЕсли;
	
	Если СтруктураОбъекта.ПометкаУдаления Тогда
		ЗагружаемыйОбъект.Статус = Перечисления.СтатусыДействияВидовЦен.НеДействует;
	Иначе
		ЗагружаемыйОбъект.Статус = Перечисления.СтатусыДействияВидовЦен.Действует;
	КонецЕсли;
	
	ИсключаяСвойства = "Идентификатор";
			
КонецПроцедуры

Процедура ЗаполнитьМассивПроверяемыхРеквизитовБлокировки(МетаданныеОбъекта, МассивПроверяемыхРеквизитов, СтандартнаяОбработка) Экспорт
	
	МассивПроверяемыхРеквизитов.Добавить("ИспользоватьПриПродаже");
	МассивПроверяемыхРеквизитов.Добавить("Наименование");
	МассивПроверяемыхРеквизитов.Добавить("Наценка");
	МассивПроверяемыхРеквизитов.Добавить("Округлять");
	МассивПроверяемыхРеквизитов.Добавить("Предопределенный");
	МассивПроверяемыхРеквизитов.Добавить("ПометкаУдаления");
	МассивПроверяемыхРеквизитов.Добавить("СпособРасчетаЦены");
	МассивПроверяемыхРеквизитов.Добавить("Статус");
	МассивПроверяемыхРеквизитов.Добавить("ТочностьОкругления");	
	
КонецПроцедуры

Процедура ЗаполнитьСоставВыгружаемыхОбъектов(РеквизитыИСвойства, ФорматСообщения, СтандартнаяОбработка) Экспорт

	Перем адаптер_НастройкиОбмена;
	адаптер_НастройкиОбмена = ОбщегоНазначения.ОбщийМодуль("адаптер_НастройкиОбмена");
	
	адаптер_НастройкиОбмена.УстановитьРеквизиты(
		РеквизитыИСвойства,
		РеквизитыИСвойства.МетаданныеОбъекта,
		ВыгружаемыеРеквизиты());	
		
КонецПроцедуры

#КонецОбласти // Конец ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

функция ТочностьОкругленияПоВходящимДанным(ПорядокОкругления)
	
	Если ПорядокОкругления = "Окр0_01" Тогда
		Возврат 0.01; 
	ИначеЕсли ПорядокОкругления = "Окр0_05" Тогда
		Возврат 0.05;
	ИначеЕсли ПорядокОкругления = "Окр0_1" Тогда
		Возврат 0.1;
	ИначеЕсли ПорядокОкругления = "Окр0_5" Тогда
		Возврат 0.5;
	ИначеЕсли ПорядокОкругления = "Окр1" Тогда
		Возврат 1;
	ИначеЕсли ПорядокОкругления = "Окр5" Тогда
		Возврат 5;
	ИначеЕсли ПорядокОкругления = "Окр10" Тогда	
		Возврат 10;
	ИначеЕсли ПорядокОкругления = "Окр50" Тогда	
		Возврат 50;
	ИначеЕсли ПорядокОкругления = "Окр100" Тогда
		Возврат 100;
	Иначе
		Возврат 0.01;
	КонецЕсли;
			
КонецФункции

Функция ВыгружаемыеРеквизиты()
		
	ВыгружаемыеРеквизиты = Новый Массив;
	
	ВыгружаемыеРеквизиты.Добавить("ВалютаЦены");
	ВыгружаемыеРеквизиты.Добавить("БазовыйВидЦены");
	ВыгружаемыеРеквизиты.Добавить("Наименование");
	ВыгружаемыеРеквизиты.Добавить("ОкруглятьВБольшуюСторону");
	ВыгружаемыеРеквизиты.Добавить("ПометкаУдаления");
	ВыгружаемыеРеквизиты.Добавить("ТочностьОкругления");
	ВыгружаемыеРеквизиты.Добавить("Предопределенный");
	ВыгружаемыеРеквизиты.Добавить("Наценка");
	ВыгружаемыеРеквизиты.Добавить("СпособЗаданияЦены");
	ВыгружаемыеРеквизиты.Добавить("ЦенаВключаетНДС");
	ВыгружаемыеРеквизиты.Добавить("Статус");

	Возврат ВыгружаемыеРеквизиты;
	
КонецФункции

#КонецОбласти // Конец СлужебныеПроцедурыИФункции
